In [9]:
import pandas as pd
import matplotlib as plt
import seaborn as sns,sklearn

In [78]:
df=pd.read_csv(r"C:\Users\yuvin\Downloads\groupbyExcercise - groupbyExcercise (1).csv")
df

    Unnamed: 0        Date Product  Revenue  Quantity
0            0  2023-01-01       A      221         3
1            1  2023-01-01       B      111         8
2            2  2023-01-02       B      171        11
3            3  2023-01-02       A      141        15
4            4  2023-02-01       A       75         4
5            5  2023-02-01       B       90        12
6            6  2023-02-02       A       96        17
7            7  2023-02-02       B      170        10
8            8  2023-03-01       B      200        19
9            9  2023-03-01       A      120        10
10          10  2023-03-02       A      121        12
11          11  2023-03-02       B      150         5

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  12 non-null     int64
 1   Date        12 non-null     object
 2   Product     12 non-null     object
 3   Revenue     12 non-null     int64
 4   Quantity    12 non-null     int64
dtypes: int64(3), object(2)
memory usage: 612.0+ bytes

# 1.Arrange DataFrame df, focusing on distinct product categories. Explore the data to reveal:
* Overall revenue insights
* Average revenue patterns
* Peak quantity sold observations
* Minimum quantity sold occurrences

In [3]:
# overall revenue insights

In [15]:
df.groupby(['Product'])['Revenue'].sum()

Product
A    774
B    892
Name: Revenue, dtype: int64

In [47]:
df['Revenue']

0     221
1     111
2     171
3     141
4      75
5      90
6      96
7     170
8     200
9     120
10    121
11    150
Name: Revenue, dtype: int64

In [48]:
df['Revenue'].sum()# overall insights

1666

In [6]:
#Average revenue patterns

In [18]:
df.groupby(['Product'])['Revenue'].mean()

Product
A    129.000000
B    148.666667
Name: Revenue, dtype: float64

In [9]:
#peak quantity sold observations

In [19]:
df.groupby(['Product'])['Quantity'].max()

Product
A    17
B    19
Name: Quantity, dtype: int64

In [14]:
#minimum quantity sold ocuurances

In [21]:
df.groupby(['Product'])['Quantity'].min()

Product
A    3
B    5
Name: Quantity, dtype: int64

# 2.Aggregate DataFrame df by extracting the month and year from the 'Date' column. Calculate the collective revenue for each unique combination of month and year.

In [23]:
df

    Unnamed: 0        Date Product  Revenue  Quantity
0            0  2023-01-01       A      221         3
1            1  2023-01-01       B      111         8
2            2  2023-01-02       B      171        11
3            3  2023-01-02       A      141        15
4            4  2023-02-01       A       75         4
5            5  2023-02-01       B       90        12
6            6  2023-02-02       A       96        17
7            7  2023-02-02       B      170        10
8            8  2023-03-01       B      200        19
9            9  2023-03-01       A      120        10
10          10  2023-03-02       A      121        12
11          11  2023-03-02       B      150         5

In [29]:
df['Date']

0     2023-01-01
1     2023-01-01
2     2023-01-02
3     2023-01-02
4     2023-02-01
5     2023-02-01
6     2023-02-02
7     2023-02-02
8     2023-03-01
9     2023-03-01
10    2023-03-02
11    2023-03-02
Name: Date, dtype: object

### `to_datetime()` - convert a series or column to a datetime datatype. This allows you to access useful datetime attributes like .day, .month etc.

In [31]:
pd.to_datetime(df['Date'])

0    2023-01-01
1    2023-01-01
2    2023-01-02
3    2023-01-02
4    2023-02-01
5    2023-02-01
6    2023-02-02
7    2023-02-02
8    2023-03-01
9    2023-03-01
10   2023-03-02
11   2023-03-02
Name: Date, dtype: datetime64[ns]

### To add a new column with the month extracted from a date column in Pandas, you can use the `dt.month` or dt.`to_period()` datetime accessor.

In [43]:
df['Month'] = df['Date'].dt.month
df['Month']

0     1
1     1
2     1
3     1
4     2
5     2
6     2
7     2
8     3
9     3
10    3
11    3
Name: Month, dtype: int32

In [45]:

df['Year']=df['Date'].dt.year
df['Year']

0     2023
1     2023
2     2023
3     2023
4     2023
5     2023
6     2023
7     2023
8     2023
9     2023
10    2023
11    2023
Name: Year, dtype: int32

In [57]:
df

    Unnamed: 0       Date Product  Revenue  Quantity  Month  Year
0            0 2023-01-01       A      221         3      1  2023
1            1 2023-01-01       B      111         8      1  2023
2            2 2023-01-02       B      171        11      1  2023
3            3 2023-01-02       A      141        15      1  2023
4            4 2023-02-01       A       75         4      2  2023
5            5 2023-02-01       B       90        12      2  2023
6            6 2023-02-02       A       96        17      2  2023
7            7 2023-02-02       B      170        10      2  2023
8            8 2023-03-01       B      200        19      3  2023
9            9 2023-03-01       A      120        10      3  2023
10          10 2023-03-02       A      121        12      3  2023
11          11 2023-03-02       B      150         5      3  2023

In [75]:
df.describe().T

,count,mean,min,25%,50%,75%,max,std
Unnamed: 0,12.0,5.5,0.0,2.75,5.5,8.25,11.0,3.605551
Date,12,2023-01-31 12:00:00,2023-01-01 00:00:00,2023-01-02 00:00:00,2023-02-01 12:00:00,2023-03-01 00:00:00,2023-03-02 00:00:00,NaN
Revenue,12.0,138.833333,75.0,107.25,131.0,170.25,221.0,45.095522
Quantity,12.0,10.5,3.0,7.25,10.5,12.75,19.0,5.0
Month,12.0,2.0,1.0,1.0,2.0,3.0,3.0,0.852803
Year,12.0,2023.0,2023.0,2023.0,2023.0,2023.0,2023.0,0.0

## Calculate the collective revenue for each unique combination of month and year.

In [54]:
df.groupby(['Month','Year'])['Revenue'].unique()

Month  Year
1      2023    [221, 111, 171, 141]
2      2023       [75, 90, 96, 170]
3      2023    [200, 120, 121, 150]
Name: Revenue, dtype: object

In [55]:
df.groupby(['Month','Year'])['Revenue'].nunique()

Month  Year
1      2023    4
2      2023    4
3      2023    4
Name: Revenue, dtype: int64

In [56]:
df.groupby(['Month','Year'])['Revenue'].sum()

Month  Year
1      2023    644
2      2023    431
3      2023    591
Name: Revenue, dtype: int64

# 3.Group the DataFrame df by the 'Date' column and find the date with the highest total revenue and the date with the highest total quantity sold.

In [65]:
x=df.groupby(['Date'])['Revenue'].sum()
x

Date
2023-01-01    332
2023-01-02    312
2023-02-01    165
2023-02-02    266
2023-03-01    320
2023-03-02    271
Name: Revenue, dtype: int64

In [64]:
y=df.groupby(['Date'])['Quantity'].sum()
y

Date
2023-01-01    11
2023-01-02    26
2023-02-01    16
2023-02-02    27
2023-03-01    29
2023-03-02    17
Name: Quantity, dtype: int64

### ` idxmax()` to get the index (date) corresponding to the maximum value in each column

In [68]:
x.idxmax()#date with the highest total revenue..

Timestamp('2023-01-01 00:00:00')

In [69]:
y.idxmax()#date with the highest total quantity sold.

Timestamp('2023-03-01 00:00:00')

# 4. Group the DataFrame df by the Date and find products that have a total quantity sold greater than 10 and less than 15 .

In [87]:
x=df.groupby(['Date','Product'])['Quantity'].sum()
x

Date        Product
2023-01-01  A           3
            B           8
2023-01-02  A          15
            B          11
2023-02-01  A           4
            B          12
2023-02-02  A          17
            B          10
2023-03-01  A          10
            B          19
2023-03-02  A          12
            B           5
Name: Quantity, dtype: int64

### `The .get_level_values()` method is used on a pandas MultiIndex to extract the values from a specific index level.

In [88]:
x[(x>10) & (x<15)]# we get the highest quantity products in every month.

Date        Product
2023-01-02  B          11
2023-02-01  B          12
2023-03-02  A          12
Name: Quantity, dtype: int64

In [94]:
y = x[(x>10) & (x<15)].index.get_level_values(1)

In [95]:
y#In the jan month we get productB  highest quantity ,feb-B,mar-A

Index(['B', 'B', 'A'], dtype='object', name='Product')

# 5.Group the DataFrame df by the 'Product' column and add a new column 'Revenue Percentage' that shows the percentage of each product's revenue relative to the total revenue for that product.

In [99]:
x = df.groupby('Product')['Revenue'].sum()
x

Product
A    774
B    892
Name: Revenue, dtype: int64

In [103]:
percentage = x / x.sum() * 100

### The `map()` method in pandas allows you to transform a pandas Series or column in a DataFrame by mapping the values to new values based on a mapping function or dict.

In [105]:
df['Revenue Percentage'] = df['Product'].map(percentage)
df

    Unnamed: 0        Date Product  Revenue  Quantity  Revenue Percentage
0            0  2023-01-01       A      221         3           46.458583
1            1  2023-01-01       B      111         8           53.541417
2            2  2023-01-02       B      171        11           53.541417
3            3  2023-01-02       A      141        15           46.458583
4            4  2023-02-01       A       75         4           46.458583
5            5  2023-02-01       B       90        12           53.541417
6            6  2023-02-02       A       96        17           46.458583
7            7  2023-02-02       B      170        10           53.541417
8            8  2023-03-01       B      200        19           53.541417
9            9  2023-03-01       A      120        10           46.458583
10          10  2023-03-02       A      121        12           46.458583
11          11  2023-03-02       B      150         5           53.541417